"""Функція range()-діапазон у Python — це вбудована функція, яка генерує послідовність чисел. 
Вона найчастіше використовується в циклах для ітерації фіксовану кількість разів.
Може приймати 1 або 3 значення

Синтаксис: range(start, stop, step)

start — початкове число (необов’язковий параметр, за замовчуванням 0).
stop — кінцеве число (не включається у діапазон).
step — крок ітерації (необов’язковий параметр, за замовчуванням 1)

Коротко:
range() — це генератор послідовностей чисел.
Використовується в циклах for, щоб контролювати ітерації.
Параметри:
start — звідки починаємо (за замовчуванням 0).
stop — де зупиняємося (не включається у діапазон).
step — крок ітерації (за замовчуванням 1)."""

print("************")
print("Test:")
for i in range(0, 100, 3): #100, -100, -3
    print(f"iteration: {i}")