"""enumerate() - додає лічильник (індекс) до ітерованого об’єкта (списку, кортежу, рядка тощо) 
і повертає пари (індекс, елемент) у вигляді кортежів.

Синтаксис: enumerate(iterable, start=0)
iterable — об’єкт, який можна перебирати (список, кортеж, рядок).
start — початкове значення лічильника (за замовчуванням стоїть0).

**А ще простіше сама функція enumerate()-перелічувати, каже пронумеруй з такого індексу якщо вказати додатково.**
"""
fruits = ["apple", "banana", "cherry"]

for index, fruit in enumerate(fruits): #enumerate автоматично додає індекс до кожного елемента списку!
    print(f"{index}: {fruit}")
    print("---------")
# Чому це зручно?
# Легше працювати з індексами:
# Не потрібно вручну створювати змінну для лічильника та оновлювати її в циклі.
# Зрозумілий код:
# Ви одразу бачите індекс + значення, що покращує читабельність.
# Менше помилок:
# Не потрібно слідкувати за ручним інкрементом індексу (i += 1).
# Без enumerate (довший варіант):
fruits = ["apple", "banana", "cherry"]
index = 0

for fruit in fruits:
    print(f"{index}: {fruit}")
    index += 1
# Однаковий результат, але з enumerate код набагато чистіший і простіший!

print("======================")
for index, value in enumerate("Test", 6):
    print(f"Index is {index}, - Value: {value}")

